# GetFilterCount Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleDefinition..::..GetFilterCount Method
ScheduleDefinition Class See Also
---
Gets the number of filters in this ScheduleDefinition.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public int GetFilterCount()
```

Visual Basic
---
```text
Public Function GetFilterCount As Integer
```

Visual C++
---
```text
public:
int GetFilterCount()
```

# ### Return Value
The number of filters.
# See Also
ScheduleDefinition Class
Autodesk.Revit.DB Namespace